In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [2]:
raw_data = pd.read_csv('IndexE8.csv')
df_comp = raw_data.copy()

### Length of the Data

In [3]:
df_comp.date.describe()

count           6269
unique          6269
top       16/02/2015
freq               1
Name: date, dtype: object

In [4]:
df_comp.date = pd.to_datetime(df_comp.date, dayfirst=True)

In [5]:
df_comp.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [6]:
df_comp.date.describe()

count                    6269
unique                   6269
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

### Setting the index

In [7]:
df_comp.set_index('date', inplace=True)

In [8]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

In [9]:
df_comp = df_comp.asfreq('b')

In [10]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### Hadling missing values

In [11]:
df_comp.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [12]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

In [13]:
df_comp.spx = df_comp.spx.fillna(method='ffill')

In [14]:
df_comp.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [17]:
df_comp.dax = df_comp.dax.fillna(value=df_comp.dax.mean())

In [18]:
df_comp.isna().sum()

spx       0
dax       0
ftse      8
nikkei    8
dtype: int64

In [20]:
df_comp.ftse = df_comp.ftse.fillna(method='bfill')

In [21]:
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

In [22]:
df_comp.nikkei = df_comp.nikkei.fillna(method='bfill')

### Add or remove columns

In [23]:
df_comp['market_value'] = df_comp.spx

In [24]:
df_comp.head()

               spx      dax     ftse    nikkei  market_value
date
1994-01-07  469.90  2224.95  3445.98  18124.01        469.90
1994-01-10  475.27  2225.00  3440.58  18443.44        475.27
1994-01-11  474.13  2228.10  3413.77  18485.25        474.13
1994-01-12  474.17  2182.06  3372.02  18793.88        474.17
1994-01-13  472.47  2142.37  3360.01  18577.26        472.47

In [26]:
del df_comp['spx'],df_comp['dax'],df_comp['ftse'],df_comp['nikkei']

In [28]:
df_comp.describe()

       market_value
count   6277.000000
mean    1288.642547
std      487.868210
min      438.920000
25%      992.715221
50%     1233.761241
75%     1460.250000
max     2872.867839

### Splitting Up the data

In [29]:
size = int(len(df_comp)*0.8)

In [30]:
size

5021

In [31]:
train_df = df_comp.iloc[:size]

In [32]:
test_df = df_comp.iloc[size:]

In [33]:
train_df.tail()

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [34]:
test_df.head()

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623